In [1]:
import pandas as pd
import numpy as np

## [Pandas concat](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html)
Concatinating two dataframes row-wise

In [2]:
students = pd.DataFrame()
students['name'] = ['A', 'B', 'C', 'D']
students['age'] = [18, 17, 19, 17]
students

  name  age
0    A   18
1    B   17
2    C   19
3    D   17

In [3]:
# Adding more students
df2 = pd.DataFrame()
df2['name'] = ['E', 'F', 'G', 'H']
df2['age'] = [18, 17, 17, 18]
df2

  name  age
0    E   18
1    F   17
2    G   17
3    H   18

### Concatenating dataframes row-wise

By default, 
- `axis = 0` so dataframes are bind row-wise.
- `ignore_index = True` removes the indices of the original dataframe by default it is `ignore_index = False`.

In [4]:
pd.concat([students, df2], ignore_index = True)

  name  age
0    A   18
1    B   17
2    C   19
3    D   17
4    E   18
5    F   17
6    G   17
7    H   18

### Concatenating dataframes column-wise

In [5]:
result = pd.DataFrame()
result['subject'] = ['math', 'math', 'science', 'history']
result['score'] = [78, 98, 69, 80]
result

   subject  score
0     math     78
1     math     98
2  science     69
3  history     80

Changes made: used `axis = 1` to concatenate column wise.

Observe above the column names of the concatenated dataframe has been modified to numerical values that is because of using the parameter `ignore_index = True`.

In [6]:
pd.concat([students, result], axis = 1, ignore_index = True)

   0   1        2   3
0  A  18     math  78
1  B  17     math  98
2  C  19  science  69
3  D  17  history  80

 So to retain the column use `ignore_index = False`.

In [8]:
pd.concat([students, result], axis = 1, ignore_index = False)

  name  age  subject  score
0    A   18     math     78
1    B   17     math     98
2    C   19  science     69
3    D   17  history     80